In [1]:
import numpy as np

import pandas as pd

from pandas import Series, DataFrame

In [2]:
ser1 = Series(np.arange(3),index = ['a','b','c'])

ser1

a    0
b    1
c    2
dtype: int64

In [3]:
ser1.drop('b')

a    0
c    2
dtype: int64

In [5]:
dframe1 = DataFrame(np.arange(9).reshape((3,3)),index=['BDG','DPS','CGK'],columns=['pop','size','year'])

dframe1

     pop  size  year
BDG    0     1     2
DPS    3     4     5
CGK    6     7     8

In [6]:
dframe1.drop('CGK')

     pop  size  year
BDG    0     1     2
DPS    3     4     5

In [7]:
dframe1

     pop  size  year
BDG    0     1     2
DPS    3     4     5
CGK    6     7     8

In [8]:
dframe2 = dframe1.drop('CGK')

In [10]:
dframe2

     pop  size  year
BDG    0     1     2
DPS    3     4     5

In [11]:
dframe1

     pop  size  year
BDG    0     1     2
DPS    3     4     5
CGK    6     7     8

In [12]:
dframe1.drop('year',axis=1)

     pop  size
BDG    0     1
DPS    3     4
CGK    6     7

In [13]:
dframe1.drop('pop',axis=1)

     size  year
BDG     1     2
DPS     4     5
CGK     7     8